## 시리즈와 데이터프레임 직접 만들기
### 데이터프레임과 시리즈는 리스트나 딕셔너리와 비슷하지만 데이터를 다루는데 더 특화되어 있다

### 1. 시리즈 만들기

In [1]:
import pandas as pd
s = pd.Series(['apple',33])   #인덱스는 보통 0부터 시작
print(s)

0    apple
1       33
dtype: object

In [3]:
list_data = ['2023-04-28',3.14,'encore',100,True]
s = pd.Series(list_data)
print(s)
print()
print(type(s))

0    2023-04-28
1          3.14
2        encore
3           100
4          True
dtype: object

<class 'pandas.core.series.Series'>

In [4]:
#인덱스 배열은 변수 idx에 저장, 데이터 값 배열은 변수 val에 저장
idx = s.index
val = s.values
print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=5, step=1)


['2023-04-28' 3.14 'encore' 100 True]

In [5]:
dict_data = {'a':1,'b':2,'c':3}
s = pd.Series(dict_data)
print(s)
print(type(s))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

### 2. 시리즈를 생성할 - 문자열을 인덱스로 지정할 수도 있다.

#### 문자열을 인덱스로 지정하려면 Series 메서드의 index 인자를 통해 사용하고자 하는 문자열을 리스트에 담아 전달하면 됩니다

In [6]:
s = pd.Series(['Jane','student'], index = ['Person','Job'])
print(s)

Person       Jane
Job       student
dtype: object

### 3. 딕셔너리로 데이터프레임 생성하기
- 파이썬의 기본 자료궂로 데이터프레임 생성이 가능
- 아래 예제는 딕셔너리로 데이터프레임을 생성하는 예제
- 딕셔너리를 DataFrame 클래스에 전달해야 함
- 데이터프레임의 컬럼은 모두 시리즈,
(아래 예제는 5개의 시리즈로 구성된 데이터 프레임)

In [7]:
scientists = pd.DataFrame({
    'Name':['Rosaline Franklin','William Gosset'],
    'Occupation':['Chemist','Statistician'],
    'Born': ['1920-07-25','1876-06-13'],
    'Died': ['1958-04-16','1937-10-16'],
    'Age': [37,61]})

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

####  columns 인자를 사용하면 데이터프레임의 열 순서를 지정할 수 있다
#### (index, columns 지정)

In [8]:
scientists = pd.DataFrame(
    data ={
        #value는 list 속에 들어있는 dictionary
    'Occupation':['Chemist','Statistician'],
    'Born': ['1920-07-25','1876-06-13'],
    'Died': ['1958-04-16','1937-10-16'],
    'Age': [37,61]},
    index = ['Rosaline Franklin','William Gosset'],
    columns = ['Occupation','Born','Age','Died']
)

scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

### 딕셔너리를 데이터의 순서를 보장하지 않는다
### 순서가 보장된 딕셔너리를 전달하려면 OrderedDict 클래스를 사용

In [10]:
from collections import OrderedDict
scientists = pd.DataFrame(OrderedDict([
    ('Name',['Rosaline Franklin','William Gosset']),
    ('Occupation',['Chemist','Statistician']),
    ('Born', ['1920-07-25','1876-06-13']),
    ('Died', ['1958-04-16','1937-10-16']),
    ('Age', [37,61])
])
)
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

## 데이터프레임에서 시리즈 선택하기

In [11]:
scientists = pd.DataFrame(
    data ={
        #value는 list 속에 들어있는 dictionary
    'Occupation':['Chemist','Statistician'],
    'Born': ['1920-07-25','1876-06-13'],
    'Died': ['1958-04-16','1937-10-16'],
    'Age': [37,61]},
    index = ['Rosaline Franklin','William Gosset'],
    columns = ['Occupation','Born','Died','Age']
)

scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [14]:
first_row = scientists.loc['William Gosset']
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

# index,values 속성과 keys 메서드 사용하기

### 1. index 속성 사용하기

In [15]:
print(first_row.index)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 2. values 속성 사용하기

In [16]:
print(first_row.values)

['Statistician' '1876-06-13' '1937-10-16' 61]

### 3. keys 메서드 사용하기

In [17]:
# keys는 속성이 아닌 메서드, keys메서드는 index 속성과 같은 역할을 함
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 4. index 속성 응용하기

In [18]:
print(first_row.index[0])

Occupation

### 5. keys 메서드와 index 속성 응용하기

In [19]:
print(first_row.keys()[0])

Occupation

# 시리즈의 mean, min, max, std 메서드 사용하기

In [21]:
ages = scientists['Age']
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [22]:
print(ages.mean())

49.0

In [23]:
print(ages.min())

37

In [24]:
print(ages.std()) #표준편차

16.97056274847714

# 시리즈와 불린 추출 사용하기

In [2]:
import pandas as pd
scientists = pd.read_csv('../data/python_data/scientists.csv')
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [3]:
ages = scientists['Age']
print(ages)
print(ages.max())

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
90

In [4]:
ages.mean()

59.125

In [6]:
print(ages[ages>ages.mean()])
# 나이가 평균보다 많은 사람
# ages>ages.mean()의 값이 True인 데이터

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [7]:
ages>ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [9]:
print(type(ages>ages.mean()))

<class 'pandas.core.series.Series'>

In [10]:
#불린 추출
#리스트 형태로 참, 거짓을 담아 시리즈에 전달하면 참인 인덱스의 데이터만 추출할 수 있음

manual_bool_values = [True,True,False,False,True,True,False,True]
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [11]:
scientists.sort_values(by='Age',ascending=True).head()
# 나이순으로 오름차순

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5          John Snow  1813-03-15  1858-06-16   45           Physician
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician

In [12]:
scientists.sort_values(by='Age',ascending=False).head()
#나이순으로 내림차순

                   Name        Born        Died  Age     Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56      Biologist

## 벡터와 스칼라로 브로드캐스팅 수행하기
* 벡터 : 시리즈처럼 여러 개의 값을 가진 데이터
* 스칼라 : 단순 크기를 나타내는 데이터

In [13]:
# 같은 길이의 벡터로 더히기, 곱하기 연산을 수행 - 결과값으로 같은 길이의 벡터 출력
print(ages+ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [14]:
print(ages*ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [15]:
# 벡터의 모든 값에 스칼라 연산 - 브로드캐스팅한 결과
print(ages+100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [16]:
print(ages*2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [18]:
# 길이가 서로 다른 벡터를 연산
print(pd.Series([1,100]))

0      1
1    100
dtype: int64

In [19]:
# 시리즈와 시리즈를 연산하는 경우 = 같은 인덱스 값만 계산
# 인덱스가 일치하는 0,1만 계산 
# 나머지는 인덱스를 계산 못하므로 누락값(NaN)으로 처리
print(ages + pd.Series([1,100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [20]:
#인덱스 역순 정렬
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [21]:
print(ages*2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [22]:
#ages의 인덱스(0~7)과 rev_ages(0~7)의 인덱스가 일치하는 값끼리 연산
#벡터와 벡터의 연산은 일치하는 인덱스 값끼리 수행됨
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 불린 추출과 브로드캐스팅

In [25]:
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [24]:
print(scientists['Age'].mean())

59.125

In [23]:
print(scientists[scientists['Age']>scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [26]:
print(scientists.loc[[True,True,False,True,True,True,False,True]])
# 인덱스가 2,3,4,5,6인 행 데이터는 Bool 값이 False라 출력되지 않음

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [27]:
# df 브로드캐스팅
# 정수 데이터틑 2를 곱한 숫자가 되고,
# 문자열 데이터는 문자열이 2배로 늘어남
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

## 시리즈와 데이터프레임의 데이터 처리

In [28]:
#날짜가 문자열로 저장
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)
print(scientists['Born'])

object
object
0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [30]:
#시간 관련 작업을 할 수 있도록 datetime 자료형으로 변형
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)
print(type(born_datetime))

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

In [31]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [32]:
scientists.head(n=3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [33]:
# 칼럼의 이름을 주어지면서 추가(데이터 명시까지)
scientists['born_dt'],scientists['died_dt'] = (born_datetime,died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [34]:
print(scientists.shape)

(8, 7)

In [35]:
scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

## 시리즈, 데이터프레임의 데이터 섞기

In [36]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [37]:
#seed 메서드는 컴퓨터가 생성하는 난수의 기준값을 정하기 위해 사용
import random
random.seed(42)
random.shuffle(scientists['Age'])
print(scientists['Age'])

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

C:\ProgramData\anaconda3\lib\random.py:394: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

### 데이터프레임의 열 삭제하기

In [38]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [41]:
scientists_dropped = scientists.drop(['Age'],axis = 1)
# axis = 0 행, axis = 1 열을 의미
print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [42]:
scientists_dropped.head()

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days

## 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기

### 1. 피클로 저장하기
* 바이너리 형태로 스프레드시트 보다 작은 용량으로 데이터를 저장
* 오래 보관한다는 의미로 붙여진 이름

In [43]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [44]:
names.to_pickle('../output/scientists_names_series.pickle')

In [45]:
scientists.to_pickle('../output/scientists_df.pickle')

In [47]:
scientists_names_from_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
print(scientists_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [48]:
sc = pd.read_pickle('../output/scientists_df.pickle')
print(sc)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   56        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   41               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   37  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   61       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

### 2. CSV 파일과 TSV 파일로 저장하기

In [49]:
names.to_csv('../output/name_series.csv')

In [50]:
scientists.to_csv('../output/scientists_df.tsv',sep='\t')

In [51]:
scientists.to_csv('../output/scientists_df_no_index.csv',index=False)

In [53]:
# 시리즈는 엑셀과 구조가 맞지 않아서 엑셀 파일로 저장할 수 없습니다.
#엑셀 파일로 저장할 수 있는 df 구조로 변환
#xlwt를 찾을수 없다는 에러가 뜨면
# pip install xlwt
# 그 후 import 진행
names_df = names.to_frame()

import xlwt
names_df.to_excel('../output/scientists_names_series_df.xls')

import openpyxl
names_df.to_excel('../output/sscientists_names_series_df.xlsx')

C:\Users\Playdata\AppData\Local\Temp\ipykernel_8916\3422514866.py:6: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('../output/scientists_names_series_df.xls')